# Словник відображення йотованих букв до їх звуків
jotted_map = {
    "я": "а",
    "ю": "у",
    "є": "е",
    "ї": "і"
}

conversion_map = {
    "щ": "шч",
    "дж": "д͡ж",
    "дз": "д͡з",
}

# Словник відображення приголосних до їхніх вокалізованих відповідників
vocalized_map = {
    "в" : "ў",
    "j" : "ĭ"
}

# Словник відображення голосних до їхніх назалізованих відповідників
nasalized_map = {
    "а" : "ã",
    "у" : "ỹ",
    "о" : "õ",
    "е" : "ẽ",
    "і" : "ĩ",
    "и" : "ũ",
    '' : ''
}

# Словник відображення результатів асиміляції за дзвінкістю
voice_assimilation_map = {
  "ц": "д͡з",
  "к": "ґ",
  "ш": "ж",
  "х": "г",
  "п": "б",
  "ч": "д͡ж",
  "с": "з",
  "т": "д"
}

# Словник відображення результатів асиміляції за способом творення
WOP_assimilation_map = {
  "д": "д͡з",
  "т": "ц"
}

# Словник відображення результатів асиміляції за способом творення
POPWOP_assimilation_map = {
  "д": "д͡ж",
  "т": "ч",
  "з": "ж",
  "с": "ш",
  "д͡з": "д͡ж",
  "ц": "ч",
  "ж": "з",
  "ш": "с",
  "д͡ж": "д͡з",
  "ч": "ц"
}

# Множина, що містить голосні
vowels = {"а", "у", "о", "е", "і", "и", "ї", "є",
          "я", "ю", "ã", "ỹ", "õ", "ẽ", "ĩ"}

# Множина, що містить приголосні, що не бувають м'якими
half_palatalized = {"б", "п", "в", "м", "ф", "ч", "ґ", "к", "х", "г"}